Primero montamos nuestra unidad de Google drive

In [ ]:
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

<h1>Insert</h1>

Luego, cargamos nuestro archivo de excel, la "tabla" de autos

In [ ]:
import pandas as pd
excel_autos = pd.read_excel('/content/gdrive/MyDrive/Colab Notebooks/M3_notebooks/03_M3_PROFUNDIZA/records.xls', sheet_name='Autos')

Ahora, creamos una nueva serie con los valores que queremos agregar a la tabla

In [ ]:
new_row = pd.Series(["Honda", "Fit", 2015, 110000, 140000], index = ["Marca", 
    ...: "subMarca", "Modelo", "kilometraje", "precio MXP"])

En pandas, no  podemos insertar una fila a un dataFrame, pero podemos concatenar dos dataframes, idealmente que tengan el mismo "esquema", Es por eso a que a la serie le asignamos los mismos ííndices que tiene el dataFrame cargado desde el excel

Ahora tenemos que convertir nuestra serie en un dataFrame para poder concatenarlos posteriormente

In [ ]:
row_df = pd.DataFrame([new_row])

aquí, row_df ya es un dataframe que tiene "el mismo esquema" que el dataFrame de autos. Podemos proceder a hacer el concat

In [ ]:
excel_autos = pd.concat([ excel_autos, row_df], ignore_index=True)

Aquí, el orden en como hagamos el concat afecta en como quedarán los índices. Si no usamos la opcion de ignore_index=True, podemos tener dos veces el mismo índice, por eso, usamos la opcion de ignore_index=True, para que los índices queden bien estructurados

In [ ]:
excel_autos

        Marca subMarca  Modelo  kilometraje  precio MXP
0       Honda    Civic    2015        67000      256000
1  VolksWagen    Jetta    2009       148500      110000
2     Toyota    Sienna    2011       140500      149900
3       Honda      Fit    2015       110000      140000

Ahora veamos como insertar más de una fila a la vez

Recordamos que solo podemos hacer concatenación de dataFrames

In [ ]:
new_row1 = pd.Series(["Mazda", "CX-5", 2017, 65000, 265000])
new_row2 = pd.Series(["Susuki", "Vitara", 2016, 85000, 185000])
new_row3 = pd.Series(["Audi", "A4", 2010, 185000, 225000])

new_rows_df = pd.DataFrame(new_row1) 
new_rows_df

        0
0   Mazda
1    CX-5
2    2017
3   65000
4  265000

In [ ]:
new_rows_df = pd.concat([new_rows_df, new_row2], axis= 1)
new_rows_df

        0       0
0   Mazda  Susuki
1    CX-5  Vitara
2    2017    2016
3   65000   85000
4  265000  185000

In [ ]:
new_rows_df = pd.concat([new_rows_df, new_row3], axis= 1)
new_rows_df

        0       0       0
0   Mazda  Susuki    Audi
1    CX-5  Vitara      A4
2    2017    2016    2010
3   65000   85000  185000
4  265000  185000  225000

In [ ]:
new_rows_df=new_rows_df.T

In [ ]:
new_rows_df

        0       1     2       3       4
0   Mazda    CX-5  2017   65000  265000
0  Susuki  Vitara  2016   85000  185000
0    Audi      A4  2010  185000  225000

In [ ]:
new_rows_df.columns = ["Marca", "subMarca", "Modelo", "kilometraje", "precio MXP"]
new_rows_df

    Marca subMarca Modelo kilometraje precio MXP
0   Mazda     CX-5   2017       65000     265000
0  Susuki   Vitara   2016       85000     185000
0    Audi       A4   2010      185000     225000

In [ ]:
# new_rows_df.reset_index() No ejecutar, deja el viejo ííndice como una nueva columna

   index   Marca subMarca Modelo kilometraje precio MXP
0      0   Mazda     CX-5   2017       65000     265000
1      0  Susuki   Vitara   2016       85000     185000
2      0    Audi       A4   2010      185000     225000

In [ ]:
new_rows_df.reset_index(drop=True)

    Marca subMarca Modelo kilometraje precio MXP
0   Mazda     CX-5   2017       65000     265000
1  Susuki   Vitara   2016       85000     185000
2    Audi       A4   2010      185000     225000

In [ ]:
excel_autos

        Marca subMarca  Modelo  kilometraje  precio MXP
0       Honda    Civic    2015        67000      256000
1  VolksWagen    Jetta    2009       148500      110000
2     Toyota    Sienna    2011       140500      149900
3       Honda      Fit    2015       110000      140000

In [ ]:
excel_autos = pd.concat([excel_autos,new_rows_df], ignore_index=True)

In [ ]:
excel_autos

        Marca subMarca Modelo kilometraje precio MXP
0       Honda    Civic   2015       67000     256000
1  VolksWagen    Jetta   2009      148500     110000
2     Toyota    Sienna   2011      140500     149900
3       Honda      Fit   2015      110000     140000
4       Mazda     CX-5   2017       65000     265000
5      Susuki   Vitara   2016       85000     185000
6        Audi       A4   2010      185000     225000

<h1>Select</h1>

In [ ]:
excel_autos.loc[excel_autos["Marca"]=="Honda"]

   Marca subMarca  Modelo  kilometraje  precio MXP
0  Honda    Civic    2015        67000      256000
3  Honda      Fit    2015       110000      140000

**excel_autos["Marca"]=="Honda"** nos regresa una serie de valores Booleanos, (True | False) y con base en ese valor, se decide si es que la fila forma parte del resultado

In [ ]:
excel_autos[["subMarca", "Modelo"]]

  subMarca Modelo
0    Civic   2015
1    Jetta   2009
2   Sienna   2011
3      Fit   2015
4     CX-5   2017
5   Vitara   2016
6       A4   2010

In [ ]:
excel_autos.loc[excel_autos["Marca"]=="Honda"].loc[:,["subMarca", "Modelo"]]

  subMarca Modelo
0    Civic   2015
3      Fit   2015

Veamos un ejemplo de Autos Honda con menos de 100,000 kms

In [ ]:
excel_autos.loc[ (excel_autos["Marca"]=="Honda") & (excel_autos["kilometraje"] < 100000 ) ]

   Marca subMarca Modelo kilometraje precio MXP
0  Honda    Civic   2015       67000     256000

Una Consulta interesante: muestra los autos Honda que cuestan menos que el promedio de autos <h1>Pendiente, agregar al final, o probablemente en grupos</h1>

In [ ]:
excel_autos["precio MXP"].mean()

190128.57142857142

In [ ]:
excel_autos.loc[excel_autos["precio MXP"] < excel_autos["precio MXP"].mean()]

        Marca subMarca Modelo kilometraje precio MXP
1  VolksWagen    Jetta   2009      148500     110000
2     Toyota    Sienna   2011      140500     149900
3       Honda      Fit   2015      110000     140000
5      Susuki   Vitara   2016       85000     185000

<h1>Grupos</h1>

In [ ]:
excel_autos.groupby("Marca").size()

Marca
Audi          1
Honda         2
Mazda         1
Susuki        1
Toyota        1
VolksWagen    1
dtype: int64

Suma de precios de autos por marca

In [ ]:
import numpy as np 

#excel_autos.groupby(by=["Marca"]).agg({"precio MXP": np.sum, "Marca":np.size})

#sumaPrecios = excel_autos.groupby(by=["Marca"]).agg({"precio MXP": np.sum})

sumaPrecios = excel_autos.groupby(by=["Marca"]).agg({"precio MXP": np.sum, "Marca":np.size})

sumaPrecios

            precio MXP  Marca
Marca
Audi            225000      1
Honda           396000      2
Mazda           265000      1
Susuki          185000      1
Toyota          149900      1
VolksWagen      110000      1

In [ ]:
sumaPrecios = sumaPrecios.rename(columns={"Marca" : "cuantos"})
#sumaPrecios.reset_index()
sumaPrecios

            precio MXP  cuantos
Marca
Audi            225000        1
Honda           396000        2
Mazda           265000        1
Susuki          185000        1
Toyota          149900        1
VolksWagen      110000        1

In [ ]:
#sumaPrecios = sumaPrecios.rename(columns={"Marca" : "cuantos"})
#sumaPrecios.columnms = sumaPrecios.columns.droplevel()



sumaPrecios

            precio MXP  cuantos
Marca
Audi            225000        1
Honda           396000        2
Mazda           265000        1
Susuki          185000        1
Toyota          149900        1
VolksWagen      110000        1

Promedio de precio de autos por marca

In [ ]:
sumaPreciosLimpio = sumaPrecios.reset_index()
sumaPreciosLimpio

        Marca  precio MXP  cuantos
0        Audi      225000        1
1       Honda      396000        2
2       Mazda      265000        1
3      Susuki      185000        1
4     Toyota       149900        1
5  VolksWagen      110000        1

In [ ]:
sumaPreciosLimpio["Promedio"] = sumaPreciosLimpio["precio MXP"] / sumaPreciosLimpio["cuantos"]
sumaPreciosLimpio

        Marca  precio MXP  cuantos  Promedio
0        Audi      225000        1  225000.0
1       Honda      396000        2  198000.0
2       Mazda      265000        1  265000.0
3      Susuki      185000        1  185000.0
4     Toyota       149900        1  149900.0
5  VolksWagen      110000        1  110000.0

In [ ]:
sumaPreciosLimpio[["Marca","Promedio"]]

        Marca  Promedio
0        Audi  225000.0
1       Honda  198000.0
2       Mazda  265000.0
3      Susuki  185000.0
4     Toyota   149900.0
5  VolksWagen  110000.0

In [ ]:
promedio_por_marca = excel_autos.groupby(by=["Marca"]).agg({"precio MXP": np.sum, "Marca":np.size})
promedio_por_marca["Promedio"] = promedio_por_marca["precio MXP"] / promedio_por_marca["Marca"]
#promedio_por_marca[["Marca", "Promedio"]]
promedio_por_marca[[ "Promedio"]]

            Promedio
Marca
Audi        225000.0
Honda       198000.0
Mazda       265000.0
Susuki      185000.0
Toyota      149900.0
VolksWagen  110000.0

Promedio de precio de autos Honda

In [ ]:
sumaPreciosLimpio[sumaPreciosLimpio["Marca"] == "Honda"]

   Marca  precio MXP  cuantos  Promedio
1  Honda      396000        2  198000.0

Ahora, filtramos solo las columnas que necesitamos

In [ ]:
sumaPreciosLimpio.loc[sumaPreciosLimpio["Marca"] == "Honda",["Marca","Promedio"]]

   Marca  Promedio
1  Honda  198000.0

<h1>Actualizar</h1>

In [ ]:
excel_autos

        Marca subMarca Modelo kilometraje precio MXP
0       Honda    Civic   2015       67000     256000
1  VolksWagen    Jetta   2009      148500     110000
2     Toyota    Sienna   2011      140500     149900
3       Honda      Fit   2015      110000     140000
4       Mazda     CX-5   2017       65000     265000
5      Susuki   Vitara   2016       85000     185000
6        Audi       A4   2010      185000     225000

actualicemos el kilometraje del audi a4 a 195000 kms

In [ ]:
excel_autos.iloc[6]["kilometraje"] = 195000
excel_autos

        Marca subMarca Modelo kilometraje precio MXP
0       Honda    Civic   2015       67000     256000
1  VolksWagen    Jetta   2009      148500     110000
2     Toyota    Sienna   2011      140500     149900
3       Honda      Fit   2015      110000     140000
4       Mazda     CX-5   2017       65000     265000
5      Susuki   Vitara   2016       85000     185000
6        Audi       A4   2010      195000     225000

Otra forma utilizando caracteríísticas que no sena el índice o id

In [ ]:
excel_autos.loc[(excel_autos["Marca"]== "Audi")&(excel_autos["subMarca"]=="A4"),"kilometraje"] = 200000
excel_autos

        Marca subMarca Modelo kilometraje precio MXP
0       Honda    Civic   2015       67000     256000
1  VolksWagen    Jetta   2009      148500     110000
2     Toyota    Sienna   2011      140500     149900
3       Honda      Fit   2015      110000     140000
4       Mazda     CX-5   2017       65000     265000
5      Susuki   Vitara   2016       85000     185000
6        Audi       A4   2010      200000     225000

<h1>ELIMINAR
</h1>

Eliminemos primero a la Sienna usando su indice. En pandas no podemos eliminar datos, lo que podemos hacer es seleccionar los datos que prevalecen y guardarlos, ya sea en el mismo dataFrame o en otro

In [ ]:
index_to_delete = 2;
frames = [excel_autos.iloc[:index_to_delete], excel_autos.iloc[index_to_delete+1:]]
result = pd.concat(frames)
result

        Marca subMarca Modelo kilometraje precio MXP
0       Honda    Civic   2015       67000     256000
1  VolksWagen    Jetta   2009      148500     110000
3       Honda      Fit   2015      110000     140000
4       Mazda     CX-5   2017       65000     265000
5      Susuki   Vitara   2016       85000     185000
6        Audi       A4   2010      200000     225000

Ahora supongamos que quiero eliminar los autos que cuesten más de 200000 mxp
En lugar de eliminar los que cuestan máás de dicha cantidad, me quedo con los que cuesten igual o menos a esa cantidad.

In [ ]:
excel_autos2 = excel_autos.loc[excel_autos["precio MXP"] <= 200000]
excel_autos2

        Marca subMarca Modelo kilometraje precio MXP
1  VolksWagen    Jetta   2009      148500     110000
2     Toyota    Sienna   2011      140500     149900
3       Honda      Fit   2015      110000     140000
5      Susuki   Vitara   2016       85000     185000

In [ ]:
!pip install XlsxWriter
import xlsxwriter
excel_autos2.to_excel("/content/gdrive/MyDrive/Colab Notebooks/excelAutos2.xlsx", sheet_name="autos", engine="xlsxwriter")

Requirement already satisfied: XlsxWriter in /usr/local/lib/python3.6/dist-packages (1.3.7)

In [ ]:
excel_autos.to_csv("/content/gdrive/MyDrive/Colab Notebooks/excelAutos.csv")